app/controllers/age_groups_controller.rb

SELECT * FROM "age_groups"
---
  def index
    @age_groups = AgeGroup.all

SELECT * FROM "age_groups" WHERE ("age_groups"."id" = 953125641)
---
  def show
    @age_group = AgeGroup.find(params[:id])

SELECT * FROM "age_groups" WHERE ("age_groups"."id" = 953125641)
---
  def edit
    @age_group = AgeGroup.find(params[:id])

INSERT INTO "age_groups" ("updated_at", "quantity", "age", "created_at") VALUES('2009-04-30 09:20:39', NULL, NULL, '2009-04-30 09:20:39')
---
  def create
    @age_group = AgeGroup.new(params[:age_group])

    respond_to do |format|
      if @age_group.save

SELECT * FROM "age_groups" WHERE ("age_groups"."id" = 953125641)
---
  def update
    @age_group = AgeGroup.find(params[:id])

SELECT * FROM "age_groups" WHERE ("age_groups"."id" = 953125641)
DELETE FROM "age_groups" WHERE "id" = 953125641
---
  def destroy
    @age_group = AgeGroup.find(params[:id])
    @age_group.destroy