app/controllers/booking_requirements_controller.rb

  def index
    @booking_requirements = BookingRequirement.all
---
SELECT * FROM "booking_requirements"

  def show
    @booking_requirement = BookingRequirement.find(params[:id])
---
SELECT * FROM "booking_requirements" WHERE ("booking_requirements"."id" = 953125641)

  def edit
    @booking_requirement = BookingRequirement.find(params[:id])
---
SELECT * FROM "booking_requirements" WHERE ("booking_requirements"."id" = 953125641)

  def create
    @booking_requirement = BookingRequirement.new(params[:booking_requirement])

    respond_to do |format|
      if @booking_requirement.save
---
INSERT INTO "booking_requirements" ("updated_at", "requirement", "created_at") VALUES('2009-04-30 09:20:39', NULL, '2009-04-30 09:20:39')

  def update
    @booking_requirement = BookingRequirement.find(params[:id])
---
SELECT * FROM "booking_requirements" WHERE ("booking_requirements"."id" = 953125641)

  def destroy
    @booking_requirement = BookingRequirement.find(params[:id])
    @booking_requirement.destroy
---
SELECT * FROM "booking_requirements" WHERE ("booking_requirements"."id" = 953125641)
DELETE FROM "booking_requirements" WHERE "id" = 953125641