app/controllers/culture_administrators_controller.rb

  def index
    @culture_administrators = CultureAdministrator.all
---
SELECT * FROM "culture_administrators"

  def show
    @culture_administrator = CultureAdministrator.find(params[:id])
---
SELECT * FROM "culture_administrators" WHERE ("culture_administrators"."id" = 953125641)

  def edit
    @culture_administrator = CultureAdministrator.find(params[:id])
---
SELECT * FROM "culture_administrators" WHERE ("culture_administrators"."id" = 953125641)

  def create
    @culture_administrator = CultureAdministrator.new(params[:culture_administrator])

    respond_to do |format|
      if @culture_administrator.save
---
INSERT INTO "culture_administrators" ("name", "mobil_nr", "updated_at", "email", "created_at") VALUES(NULL, NULL, '2009-04-30 09:20:39', NULL, '2009-04-30 09:20:39')

  def update
    @culture_administrator = CultureAdministrator.find(params[:id])
---
SELECT * FROM "culture_administrators" WHERE ("culture_administrators"."id" = 953125641)

  def destroy
    @culture_administrator = CultureAdministrator.find(params[:id])
---
SELECT * FROM "culture_administrators" WHERE ("culture_administrators"."id" = 953125641)