app/controllers/districts_controller.rb

SELECT * FROM "districts"
---
  def index
    @districts = District.paginate :page => params[:page],
      :order => sort_order("name")

SELECT * FROM "districts" WHERE ("districts"."id" = 953125641)
---
  def show
    @district = District.find(params[:id])

SELECT * FROM "districts" WHERE ("districts"."id" = 953125641)
---
  def edit
    @district = District.find(params[:id])

INSERT INTO "districts" ("name", "elit_id", "updated_at", "created_at") VALUES(NULL, NULL, '2009-04-30 09:20:39', '2009-04-30 09:20:39')
---
  def create
    @district = District.new(params[:district])

    if @district.save

SELECT * FROM "districts" WHERE ("districts"."id" = 953125641)
---
  def update
    @district = District.find(params[:id])

SELECT * FROM "districts" WHERE ("districts"."id" = 953125641)
DELETE FROM "districts" WHERE "id" = 953125641
---
  def destroy
    @district = District.find(params[:id])
    @district.destroy