app/controllers/events_controller.rb

  def index
    @events = Event.visible.find :all,
      :order => "created_at DESC",
      :include => :culture_provider
---
SELECT * FROM "events"

  def create
    @event = Event.new(params[:event])

    unless current_user.can_administrate?(@event.culture_provider)
      flash[:error] = "Du har inte behörighet att komma åt sidan."
      redirect_to :action => "index"
      return
    end

    load_culture_providers()

    if @event.save
---
INSERT INTO "events" ("updated_at", "description", "to_age", "from_age", "created_at") VALUES('2009-04-30 09:20:39', NULL, NULL, NULL, '2009-04-30 09:20:39')

  def update
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 953125641)

  def destroy
    @event = Event.find(params[:id])

    unless current_user.can_administrate?(@event.culture_provider)
      flash[:error] = "Du har inte behörighet att komma åt sidan."
      redirect_to :action => "index"
      return
    end

    @event.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = 953125641)
DELETE FROM "events" WHERE "id" = 953125641