app/controllers/groups_controller.rb

SELECT * FROM "groups"
---
  def index
    @groups = Group.paginate :page => params[:page],
      :order => sort_order("name"),
      :include => { :school => :district }

SELECT * FROM "groups" WHERE ("groups"."id" = 953125641)
---
  def show
    @group = Group.find(params[:id])

SELECT * FROM "schools"
---
  def new
    @group = Group.new
    @group.school_id = params[:school_id] if params[:school_id]

    @schools = School.all :order => "name ASC"

SELECT * FROM "groups" WHERE ("groups"."id" = 953125641)
---
  def edit
    @group = Group.find(params[:id])

INSERT INTO "groups" ("name", "elit_id", "updated_at", "school_id", "created_at") VALUES('klass 1a', NULL, '2009-05-04 12:12:37', 2, '2009-05-04 12:12:37')
---
  def create
    @group = Group.new(params[:group])

    if @group.save

SELECT * FROM "groups" WHERE ("groups"."id" = 953125641)
---
  def update
    @group = Group.find(params[:id])

SELECT * FROM "groups" WHERE ("groups"."id" = 953125641)
---
  def destroy
    @group = Group.find(params[:id])