app/controllers/notification_requests_controller.rb

SELECT * FROM "notification_requests"
---
  def index
    @notification_requests = NotificationRequest.all

SELECT * FROM "notification_requests" WHERE ("notification_requests"."id" = 953125641)
---
  def show
    @notification_request = NotificationRequest.find(params[:id])

SELECT * FROM "notification_requests" WHERE ("notification_requests"."id" = 953125641)
---
  def edit
    @notification_request = NotificationRequest.find(params[:id])

INSERT INTO "notification_requests" ("updated_at", "send_sms", "send_mail", "created_at") VALUES('2009-04-30 09:20:39', NULL, NULL, '2009-04-30 09:20:39')
---
  def create
    @notification_request = NotificationRequest.new(params[:notification_request])

    respond_to do |format|
      if @notification_request.save

SELECT * FROM "notification_requests" WHERE ("notification_requests"."id" = 953125641)
---
  def update
    @notification_request = NotificationRequest.find(params[:id])

SELECT * FROM "notification_requests" WHERE ("notification_requests"."id" = 953125641)
DELETE FROM "notification_requests" WHERE "id" = 953125641
---
  def destroy
    @notification_request = NotificationRequest.find(params[:id])
    @notification_request.destroy