app/controllers/occasions_controller.rb

SELECT * FROM "occasions"
---
  def index
    @occasions = Occasion.all

SELECT * FROM "occasions" WHERE ("occasions"."id" = 953125641)
---
  def show
    @occasion = Occasion.find(params[:id])

SELECT * FROM "occasions" WHERE ("occasions"."id" = 953125641)
---
  def edit
    @occasion = Occasion.find(params[:id])

INSERT INTO "occasions" ("updated_at", "date", "seats", "description", "address", "created_at") VALUES('2009-04-30 09:20:39', NULL, NULL, NULL, NULL, '2009-04-30 09:20:39')
---
  def create
    @occasion = Occasion.new(params[:occasion])

    respond_to do |format|
      if @occasion.save

SELECT * FROM "occasions" WHERE ("occasions"."id" = 953125641)
---
  def update
    @occasion = Occasion.find(params[:id])

SELECT * FROM "occasions" WHERE ("occasions"."id" = 953125641)
DELETE FROM "occasions" WHERE "id" = 953125641
---
  def destroy
    @occasion = Occasion.find(params[:id])
    @occasion.destroy