app/controllers/schools_controller.rb

SELECT * FROM "districts"
---
  def new
    @school = School.new
    @school.district_id = params[:district_id] if params[:district_id]

    @districts = District.all