app/controllers/schools_controller.rb

SELECT * FROM "schools"
---
  def index
    @schools = School.all

SELECT * FROM "schools" WHERE ("schools"."id" = 953125641)
SELECT * FROM "districts" WHERE ("districts"."id" IS NULL) LIMIT 1
---
  def show
    @school = School.find(params[:id])
    @district_name = District.find_by_id(@school.district_id).name

SELECT * FROM "schools" WHERE ("schools"."id" = 953125641)
---
  def edit
    @school = School.find(params[:id])

INSERT INTO "schools" ("name", "elit_id", "updated_at", "district_id", "created_at") VALUES('Fosieskolan', NULL, '2009-05-04 11:42:51', NULL, '2009-05-04 11:42:51')
---
  def create
    @school = School.new(params[:school])

    respond_to do |format|
      if @school.save

SELECT * FROM "schools" WHERE ("schools"."id" = 953125641)
UPDATE "schools" SET "name" = 'Rosengårdsskolun', "updated_at" = '2009-05-04 11:14:35' WHERE "id" = 1
---
  def update
    @school = School.find(params[:id])

    respond_to do |format|
      if @school.update_attributes(params[:school])

SELECT * FROM "schools" WHERE ("schools"."id" = 953125641)
DELETE FROM "schools" WHERE "id" = 953125641
---
  def destroy
    @school = School.find(params[:id])
    @school.destroy