app/controllers/tickets_controller.rb

SELECT * FROM "tickets"
---
  def index
    @tickets = Ticket.all

SELECT * FROM "tickets" WHERE ("tickets"."id" = 953125641)
---
  def show
    @ticket = Ticket.find(params[:id])

SELECT * FROM "tickets" WHERE ("tickets"."id" = 953125641)
---
  def edit
    @ticket = Ticket.find(params[:id])

INSERT INTO "tickets" ("updated_at", "state", "created_at") VALUES('2009-04-30 09:20:40', NULL, '2009-04-30 09:20:40')
---
  def create
    @ticket = Ticket.new(params[:ticket])

    respond_to do |format|
      if @ticket.save

SELECT * FROM "tickets" WHERE ("tickets"."id" = 953125641)
---
  def update
    @ticket = Ticket.find(params[:id])

SELECT * FROM "tickets" WHERE ("tickets"."id" = 953125641)
DELETE FROM "tickets" WHERE "id" = 953125641
---
  def destroy
    @ticket = Ticket.find(params[:id])
    @ticket.destroy